automation/backend/artillery-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 100
      name: "Ramp up to baseline"
    - duration: 60
      arrivalRate: 100
      name: "Sustained baseline load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Browse & Pricing flow"
    flow:
      - get:
          url: "/api/pricing"
      - post:
          url: "/api/auth/login"
          json:
            email: "shaiksuhelbasha609@gmail.com"
            password: "123"
      - get:
          url: "/api/orders?userId=usr_cust1"
      - get:
          url: "/api/wallet/usr_cust1"